static/html/articles/Shell-Cookie.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2016-11-10 Thu 13:03 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Shell Cookies</title>
<meta name="generator" content="Org mode">
<meta name="author" content="冰糖火箭筒(Junjia Ni)">
<meta name="description" content="记住一些命令"
>
<meta name="keywords" content="shell,emacs,etags">
<link rel="stylesheet" type="text/css" href="/static/article.css"><!--[if lt IE 9]>
<![endif]-->
</head>
<body>
<div id="content">
<header>
<h1 class="title">Shell Cookies</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org98f6777">1. 前言</a></li>
<li><a href="#org0c74c65">2. ffmpeg</a></li>
<li><a href="#org34976e3">3. ab</a></li>
<li><a href="#org08a9fbf">4. grep</a></li>
<li><a href="#orgee68f36">5. Emacs</a>
<ul>
<li><a href="#org1c0c29f">5.1. 插入当前时间</a></li>
<li><a href="#orgfddbd82">5.2. Org-mode</a>
<ul>
<li><a href="#org9bfd2d7">5.2.1. Table Sort</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org131e867">6. etags &amp; ctags</a></li>
<li><a href="#orgdf6fe67">7. 用户篇</a>
<ul>
<li><a href="#org845e444">7.1. 增加用户：</a></li>
<li><a href="#orga0d5413">7.2. 批量增加用户:</a></li>
<li><a href="#orgd407821">7.3. 增加用户到组:</a></li>
</ul>
</li>
<li><a href="#org145fd98">8. 尾声</a></li>
</ul>
</div>
</nav>


<div id="outline-container-org98f6777" class="outline-2">
<h2 id="org98f6777"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
一些常用的命令，包括使用Emacs的小技巧。
</p>
</div>
</div>

<div id="outline-container-org0c74c65" class="outline-2">
<h2 id="org0c74c65"><span class="section-number-2">2</span> ffmpeg</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">-r &#25351;&#23450;&#39057;&#29575;</span>
$ ffmpeg -i xxx.mp4 -r 25 xxx.%05d.gif
</pre>
</div>
</div>
</div>

<div id="outline-container-org34976e3" class="outline-2">
<h2 id="org34976e3"><span class="section-number-2">3</span> ab</h2>
<div class="outline-text-2" id="text-3">
<p>
Apache HTTP server benchmarking tool <br >
常用的参数
</p>
<pre class="example">
-n 总请求
-c 并发数
-t 测试所进行的最大秒数
-k 打开KeepAlive功能
</pre>

<p>
结果解释
</p>
<pre class="example">
Server Software:        nginx/1.4.6
Server Hostname:        10.69.109.51
Server Port:            80

Document Path:          /login.html
Document Length:        1935 bytes

Concurrency Level:      100             # 并发数
Time taken for tests:   0.552 seconds   # 测试时间
Complete requests:      1000            # 完成的请求数
Failed requests:        0               # 失败的请求数
Total transferred:      2249000 bytes   # 总共传输的数据量
HTML transferred:       1935000 bytes   # 请求页面大小
Requests per second:    1810.97 [#/sec] (mean)  # 每秒处理的请求数（事务数） 平均值
Time per request:       55.219 [ms] (mean)      # 每次并发耗时 平均值
Time per request:       0.552 [ms] (mean, across all concurrent requests) # 每次请求耗时 平均值 注：每次请求耗时 * 并发数 = 每次并发耗时
Transfer rate:          3977.41 [Kbytes/sec] received # 网络中传输速率

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        5   25  10.5     23      56
Processing:    10   28   8.9     26      58
Waiting:       10   27   8.8     26      58
Total:         28   53  10.9     51      82

Percentage of the requests served within a certain time (ms)
  50%     51
  66%     55
  75%     58
  80%     64
  90%     70
  95%     73
  98%     75
  99%     80
 100%     82 (longest request)
</pre>
<p>
Reference:
</p>
<ul class="org-ul">
<li><a href="http://www.cnblogs.com/netflu/archive/2010/01/07/1641101.html">http://www.cnblogs.com/netflu/archive/2010/01/07/1641101.html</a></li>
<li><a href="http://www.nginx.cn/110.html">http://www.nginx.cn/110.html</a></li>
</ul>
</div>
</div>

<div id="outline-container-org08a9fbf" class="outline-2">
<h2 id="org08a9fbf"><span class="section-number-2">4</span> grep</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-sh">grep -rnw <span style="color: #8abeb7;">'/path/to/somewhere/'</span> -e <span style="color: #8abeb7;">"pattern"</span>
</pre>
</div>
<p>
Reference: <a href="http://stackoverflow.com/a/16957078/1925954">http://stackoverflow.com/a/16957078/1925954</a>
</p>
</div>
</div>

<div id="outline-container-orgee68f36" class="outline-2">
<h2 id="orgee68f36"><span class="section-number-2">5</span> Emacs</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-org1c0c29f" class="outline-3">
<h3 id="org1c0c29f"><span class="section-number-3">5.1</span> 插入当前时间</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-sh">C-u M-! date
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfddbd82" class="outline-3">
<h3 id="orgfddbd82"><span class="section-number-3">5.2</span> Org-mode</h3>
<div class="outline-text-3" id="text-5-2">
</div><div id="outline-container-org9bfd2d7" class="outline-4">
<h4 id="org9bfd2d7"><span class="section-number-4">5.2.1</span> Table Sort</h4>
<div class="outline-text-4" id="text-5-2-1">
<p>
<code>C-c ^</code>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org131e867" class="outline-2">
<h2 id="org131e867"><span class="section-number-2">6</span> etags &amp; ctags</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b294bb;">cd</span> /path/to/my/project
ctags -e -R *.cpp *.hpp *.h

<span style="color: #b294bb;">cd</span> /path/to/my/project
find . | grep <span style="color: #8abeb7;">".*\.\(hh\|hxx\|cc\)"</span> | xargs etags -f TAGS

<span style="color: #b294bb;">cd</span> /path/to/my/project
find . -type f -iname <span style="color: #8abeb7;">"*.[ch]"</span> | etags -
</pre>
</div>
<p>
常用热键
</p>
<pre class="example">
`M-.’ (‘find-tag’) – find a tag, that is, use the Tags file to look up a definition. If there are multiple tags in the project with the same name
`C-u M-.’ to go to the next match.
‘M-x find-tag-other-window’ – selects the buffer containing the tag’s definition in another window, and move point there.
‘M-*’ (‘pop-tag-mark’) – jump back
‘M-x tags-search’ – regexp-search through the source files indexed by a tags file (a bit like ‘grep’)
‘M-x tags-query-replace’ – query-replace through the source files indexed by a tags file
`M-,’ (‘tags-loop-continue’) – resume  ‘tags-search’ or ‘tags-query-replace’ starting at point in a source file
‘M-x tags-apropos’ – list all tags in a tags file that match a regexp
‘M-x list-tags’ – list all tags defined in a source file
</pre>
</div>
</div>

<div id="outline-container-orgdf6fe67" class="outline-2">
<h2 id="orgdf6fe67"><span class="section-number-2">7</span> 用户篇</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-org845e444" class="outline-3">
<h3 id="org845e444"><span class="section-number-3">7.1</span> 增加用户：</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">-s&#25351;&#23450;shell</span>
<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">-g&#25351;&#23450;&#32452;&#21517;</span>
<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">-G&#25351;&#23450;&#21152;&#20837;&#32452;&#65288;&#38468;&#21152;&#32452;&#65289;</span>
useradd -s /bin/sh -g group &#8211;G adm,root gem
</pre>
</div>

<p>
<b>Reference:</b>
</p>
<ul class="org-ul">
<li><a href="http://blog.sina.com.cn/s/blog_47051c800100oegn.html">http://blog.sina.com.cn/s/blog_47051c800100oegn.html</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga0d5413" class="outline-3">
<h3 id="orga0d5413"><span class="section-number-3">7.2</span> 批量增加用户:</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #969896; font-style: italic;">#</span><span style="color: #969896; font-style: italic;">!/bin/</span><span style="color: #b5bd68;">bash/</span>
<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">&#21019;&#24314;&#29992;&#25143;</span>
<span style="color: #b5bd68;">for</span> i<span style="color: #b5bd68;"> in</span> <span style="color: #b294bb;">`cat user.list`</span>
<span style="color: #b5bd68;">do</span>
    useradd -d /home/$<span style="color: #f0c674;">i</span> -m $<span style="color: #f0c674;">i</span>
    useradd -g wsng $<span style="color: #f0c674;">i</span>
    <span style="color: #b294bb;">echo</span> <span style="color: #8abeb7;">"password"</span> | passwd --stdin $<span style="color: #f0c674;">i</span>
<span style="color: #b5bd68;">done</span>
</pre>
</div>

<pre class="example">
someone1
someone2
someone3
</pre>

<p>
<b>Reference:</b>
</p>
<ul class="org-ul">
<li><a href="http://blog.chinaunix.net/uid-26301963-id-3055415.html">http://blog.chinaunix.net/uid-26301963-id-3055415.html</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd407821" class="outline-3">
<h3 id="orgd407821"><span class="section-number-3">7.3</span> 增加用户到组:</h3>
<div class="outline-text-3" id="text-7-3">
<ol class="org-ol">
<li><p>
增加一个新用户到主要用户组：
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">&#22686;&#21152;&#29992;&#25143;icecream&#21040;wsng</span>
<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">-g&#23558;&#26032;&#22686;&#21152;&#30340;&#29992;&#25143;&#21021;&#22987;&#21270;&#20026;&#25351;&#23450;&#30331;&#24405;&#32452;&#65292;&#27492;&#21517;&#24517;&#39035;&#23384;&#22312;</span>
useradd -g wsng icecream
</pre>
</div></li>
<li><p>
增加一个已有用户到一个已有用户组中
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">&#29992;&#25143;icecream&#19981;&#24517;&#31163;&#24320;&#21407;&#32452;</span>
usermod -a -G wsng icecream
<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">&#23558;&#29992;&#25143;&#32452;&#25913;&#20026;wsng</span>
usermod -g wsng icecream
</pre>
</div></li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org145fd98" class="outline-2">
<h2 id="org145fd98"><span class="section-number-2">8</span> 尾声</h2>
</div>
</div>
<div id="postamble" class="status">
<div id="meta-article"><p class="author">冰糖火箭筒(Junjia Ni)</p>
<p class="email"><a href="mailto:creamidea(AT)gmail.com">creamidea(AT)gmail.com</a></p>
<p class="date">2015-12-27</p>
<p class="export-date">2016-11-10 Thu 13:03</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 9.0)</p>
<p class="validation"></p>
<p class="last-modification-time">2016-10-23 Sun 23:09</p></div><script src="/static/article.js"></script><!-- Google Analytics --><script>(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');ga('create', 'UA-38213594-1', 'auto');ga('send', 'pageview');</script><!-- End Google Analytics -->
</div>
</body>
</html>
